Revit 2024 API
BuiltInFailures.StairRampFailures.CannotDrawStairs Property
 Can't make stairs
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotDrawStairs { get; }
Visual Basic
Public Shared ReadOnly Property CannotDrawStairs As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotDrawStairs {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace